# Pandas tutorial

## 1. Setup

### Import

Before moving on to learn pandas first we need to install it and import it. If you install [Anaconda distributions](https://www.anaconda.com/) on your local machine or using [Google Colab](https://research.google.com/colaboratory) then pandas will already be available there, otherwise, you follow this installation process from [pandas official's website](https://pandas.pydata.org/docs/getting_started/install.html).

In [2]:
# Importing libraries
import pandas as pd

In [3]:
# we can set numbers for how many rows and columns will be displayed
pd.set_option('display.min_rows', 10) #default will be 10 
pd.set_option('display.max_columns', 20)

### Creating a dataframe

A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

In [4]:
mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

my_df = pd.DataFrame(mydataset)

print(my_df)

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

### Labels
> The default indexes are integers i.e. 0,1,2,... 

 But you can define your own index or reindex a dataframe

In [5]:
mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

my_df1 = pd.DataFrame(mydataset, index = ["a","b", "c"])

print(my_df1)

    cars  passings
a    BMW         3
b  Volvo         7
c   Ford         2

### Accessing rows in dataframe
You can access the rows in a dataframe by using function loc and assining the index of the row

In [6]:
# refer to the row index
print(my_df.loc[0])

cars        BMW
passings      3
Name: 0, dtype: object

In [7]:
# refer to the row index
print(my_df1.loc["c"])

cars        Ford
passings       2
Name: c, dtype: object

In [8]:
# return more than one row
print(my_df.loc[[0,1]])

    cars  passings
0    BMW         3
1  Volvo         7

## 2. Loading Different Data Formats Into a Pandas Data Frame

### Reading CSV file

In [10]:
# read csv file

df = pd.read_csv('./online_store_customer_data.csv')
df.head(3)

,Transaction_date,Transaction_ID,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Referal,Amount_spent
0,1/1/2019,151200,Female,19.0,Single,Kansas,Basic,Unemployment,Other,1.0,2051.36
1,1/1/2019,151201,Male,49.0,Single,Illinois,Basic,self-employed,Card,0.0,544.04
2,1/1/2019,151202,Male,63.0,Married,New Mexico,Basic,workers,PayPal,1.0,1572.60

In [14]:
# Loading csv file with skip first 2 rows without header
df_csv = pd.read_csv('./online_store_customer_data.csv', skiprows=2, header=None)
df_csv.head(3)

,0,1,2,3,4,5,6,7,8,9,10
0,1/1/2019,151201,Male,49.0,Single,Illinois,Basic,self-employed,Card,0.0,544.04
1,1/1/2019,151202,Male,63.0,Married,New Mexico,Basic,workers,PayPal,1.0,1572.60
2,1/1/2019,151203,NaN,18.0,Single,Virginia,Platinum,workers,Card,1.0,1199.79

### Write CSV file

In [15]:
# saving df_url dataframe to csv file
df_csv.to_csv('./save_csv.csv')

# 3 Working with columns

### Accessing all column names

In [11]:
# all columns
print(df.columns)
# one column name using index
print(df.columns[0])

Index(['Transaction_date', 'Transaction_ID', 'Gender', 'Age', 'Marital_status',
       'State_names', 'Segment', 'Employees_status', 'Payment_method',
       'Referal', 'Amount_spent'],
      dtype='object')
Transaction_date

Print column named "Age"

In [13]:
## Write your answer here
print(df.columns[3])

Age

### Rename Column

In [22]:
# df.rename(columns = {'old':'new'}, inplace=True)

# Rename Gender to sex
df.rename(columns= {'Gender':'Sex'}, inplace=True)
# check if the column is renamed correctly
print(df.columns)

Index(['Transaction_date', 'Transaction_ID', 'Sex', 'Age', 'Marital_status',
       'State_names', 'Segment', 'Employees_status', 'Payment_method',
       'Referal', 'Amount_spent'],
      dtype='object')

### Accessing columns in dataframe

In [23]:
# using .
print("# using .")
print(df.Sex)
# using []
print("\n\n # using []")
print(df['Sex'])

# using .
0       Female
1         Male
2         Male
3          NaN
4         Male
         ...
2507    Female
2508    Female
2509      Male
2510       NaN
2511      Male
Name: Sex, Length: 2512, dtype: object


 # using []
0       Female
1         Male
2         Male
3          NaN
4         Male
         ...
2507    Female
2508    Female
2509      Male
2510       NaN
2511      Male
Name: Sex, Length: 2512, dtype: object

### Difference between series and dataframe as return type

In [24]:
# The following return a series
s = df['Sex']
print(s)
# The following return a dataframe
s = df [['Sex']]
print(s)

0       Female
1         Male
2         Male
3          NaN
4         Male
         ...
2507    Female
2508    Female
2509      Male
2510       NaN
2511      Male
Name: Sex, Length: 2512, dtype: object
         Sex
0     Female
1       Male
2       Male
3        NaN
4       Male
...      ...
2507  Female
2508  Female
2509    Male
2510     NaN
2511    Male

[2512 rows x 1 columns]

### Change order of selected columns

In [25]:
# select two or more columns
temp_df = df[['Sex', 'Age']]
print(temp_df)
# chnage order of the columns
temp_df = df[['Age', 'Sex']]
print(temp_df)

         Sex   Age
0     Female  19.0
1       Male  49.0
2       Male  63.0
3        NaN  18.0
4       Male  27.0
...      ...   ...
2507  Female  57.0
2508  Female  36.0
2509    Male  22.0
2510     NaN  44.0
2511    Male  48.0

[2512 rows x 2 columns]
       Age     Sex
0     19.0  Female
1     49.0    Male
2     63.0    Male
3     18.0     NaN
4     27.0    Male
...    ...     ...
2507  57.0  Female
2508  36.0  Female
2509  22.0    Male
2510  44.0     NaN
2511  48.0    Male

[2512 rows x 2 columns]

### Delete a column

In [26]:
temp_df = df[['Sex', 'Age']]
#delete column sex
temp_df =temp_df.drop('Sex', axis=1)
print(temp_df)

temp_df = df[['Sex', 'Age']]
# alternate syntex
temp_df.drop('Sex', axis=1, inplace=True)
print(temp_df)

       Age
0     19.0
1     49.0
2     63.0
3     18.0
4     27.0
...    ...
2507  57.0
2508  36.0
2509  22.0
2510  44.0
2511  48.0

[2512 rows x 1 columns]
       Age
0     19.0
1     49.0
2     63.0
3     18.0
4     27.0
...    ...
2507  57.0
2508  36.0
2509  22.0
2510  44.0
2511  48.0

[2512 rows x 1 columns]

/var/folders/yl/hc0wg3cd5577fyq8rq7spkx00000gn/T/ipykernel_9903/1310413385.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  temp_df.drop('Sex', axis=1, inplace=True)

# 4 Working with Rows

### Get the row index and labels

In [27]:
idx = df.index
print(idx)

RangeIndex(start=0, stop=2512, step=1)

### Drop/Delete row

In [20]:
print(df.head())

  Transaction_date  Transaction_ID     Sex   Age Marital_status  State_names  \
0         1/1/2019          151200  Female  19.0         Single       Kansas
1         1/1/2019          151201    Male  49.0         Single     Illinois
2         1/1/2019          151202    Male  63.0        Married   New Mexico
3         1/1/2019          151203     NaN  18.0         Single     Virginia
4         1/1/2019          151204    Male  27.0         Single  Connecticut

    Segment Employees_status Payment_method  Referal  Amount_spent
0     Basic     Unemployment          Other      1.0       2051.36
1     Basic    self-employed           Card      0.0        544.04
2     Basic          workers         PayPal      1.0       1572.60
3  Platinum          workers           Card      1.0       1199.79
4     Basic    self-employed           Card      0.0           NaN

In [21]:
# deleting first row i.e. index=0
df =df.drop(0)
print(df.head())

  Transaction_date  Transaction_ID   Sex   Age Marital_status  State_names  \
1         1/1/2019          151201  Male  49.0         Single     Illinois
2         1/1/2019          151202  Male  63.0        Married   New Mexico
3         1/1/2019          151203   NaN  18.0         Single     Virginia
4         1/1/2019          151204  Male  27.0         Single  Connecticut
5         1/3/2019          151205  Male  71.0         Single       Hawaii

    Segment Employees_status Payment_method  Referal  Amount_spent
1     Basic    self-employed           Card      0.0        544.04
2     Basic          workers         PayPal      1.0       1572.60
3  Platinum          workers           Card      1.0       1199.79
4     Basic    self-employed           Card      0.0           NaN
5     Basic        Employees         PayPal      1.0       2922.66

In [22]:
# deleting two row i.e. index=3,5
df =df.drop([3,5])
print(df.head())

  Transaction_date  Transaction_ID     Sex   Age Marital_status  State_names  \
1         1/1/2019          151201    Male  49.0         Single     Illinois
2         1/1/2019          151202    Male  63.0        Married   New Mexico
4         1/1/2019          151204    Male  27.0         Single  Connecticut
6         1/3/2019          151206  Female  34.0        Married   New Mexico
7         1/3/2019          151207    Male  37.0        Married  Connecticut

    Segment Employees_status Payment_method  Referal  Amount_spent
1     Basic    self-employed           Card      0.0        544.04
2     Basic          workers         PayPal      1.0       1572.60
4     Basic    self-employed           Card      0.0           NaN
6  Platinum        Employees         PayPal      1.0       1481.42
7     Basic          workers         PayPal      1.0       1149.55

### Deleting or selecting rows by values in a column

In [23]:
temp_df = df[df['Marital_status'] =='Single']
print(temp_df.head())

   Transaction_date  Transaction_ID   Sex   Age Marital_status  \
1          1/1/2019          151201  Male  49.0         Single
4          1/1/2019          151204  Male  27.0         Single
13         1/5/2019          151213  Male  47.0         Single
15         1/6/2019          151215  Male  16.0         Single
23         1/9/2019          151223  Male  47.0         Single

       State_names   Segment Employees_status Payment_method  Referal  \
1         Illinois     Basic    self-employed           Card      0.0
4      Connecticut     Basic    self-employed           Card      0.0
13  South Carolina     Basic        Employees         PayPal      1.0
15        New York  Platinum          workers          Other      1.0
23        Nebraska     Basic    self-employed         PayPal      1.0

    Amount_spent
1         544.04
4            NaN
13       1719.83
15       1005.92
23       2407.36

In [30]:
temp_df1 = df.drop(df[df['Marital_status'] == 'Single'].index,axis=0)
print(temp_df1.head())

  Transaction_date  Transaction_ID     Sex   Age Marital_status  State_names  \
2         1/1/2019          151202    Male  63.0        Married   New Mexico
6         1/3/2019          151206  Female  34.0        Married   New Mexico
7         1/3/2019          151207    Male  37.0        Married  Connecticut
8         1/4/2019          151208    Male  75.0        Married      Florida
9         1/4/2019          151209  Female  41.0        Married      Vermont

    Segment Employees_status Payment_method  Referal  Amount_spent
2     Basic          workers         PayPal      1.0       1572.60
6  Platinum        Employees         PayPal      1.0       1481.42
7     Basic          workers         PayPal      1.0       1149.55
8    Silver        Employees           Card      0.0       1046.20
9      Gold     Unemployment           Card      1.0       2730.60